{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "conv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn_conv1", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["conv1", 0, 0]]], "name": "bn_conv1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["bn_conv1", 0, 0]]], "name": "activation_1"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [1, 1], "border_mode": "valid"}, "inbound_nodes": [[["activation_1", 0, 0]]], "name": "maxpooling2d_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2a_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "res2a_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2a_branch2a", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2a_branch2a", 0, 0]]], "name": "bn2a_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0]]], "name": "activation_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2a_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_2", 0, 0]]], "name": "res2a_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2a_branch2b", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2a_branch2b", 0, 0]]], "name": "bn2a_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0]]], "name": "activation_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2a_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_3", 0, 0]]], "name": "res2a_branch2c"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2a_branch1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "res2a_branch1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2a_branch2c", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2a_branch2c", 0, 0]]], "name": "bn2a_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2a_branch1", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2a_branch1", 0, 0]]], "name": "bn2a_branch1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn2a_branch2c", 0, 0], ["bn2a_branch1", 0, 0]]], "name": "merge_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "activation_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2b_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_4", 0, 0]]], "name": "res2b_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2b_branch2a", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2b_branch2a", 0, 0]]], "name": "bn2b_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0]]], "name": "activation_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2b_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_5", 0, 0]]], "name": "res2b_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2b_branch2b", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2b_branch2b", 0, 0]]], "name": "bn2b_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0]]], "name": "activation_6"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2b_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_6", 0, 0]]], "name": "res2b_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2b_branch2c", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2b_branch2c", 0, 0]]], "name": "bn2b_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn2b_branch2c", 0, 0], ["activation_4", 0, 0]]], "name": "merge_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "activation_7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2c_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_7", 0, 0]]], "name": "res2c_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2c_branch2a", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2c_branch2a", 0, 0]]], "name": "bn2c_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0]]], "name": "activation_8"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2c_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_8", 0, 0]]], "name": "res2c_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2c_branch2b", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2c_branch2b", 0, 0]]], "name": "bn2c_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0]]], "name": "activation_9"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2c_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_9", 0, 0]]], "name": "res2c_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2c_branch2c", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2c_branch2c", 0, 0]]], "name": "bn2c_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn2c_branch2c", 0, 0], ["activation_7", 0, 0]]], "name": "merge_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "activation_10"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5a_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_10", 0, 0]]], "name": "res5a_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5a_branch2a", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5a_branch2a", 0, 0]]], "name": "bn5a_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["bn5a_branch2a", 0, 0]]], "name": "activation_11"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5a_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_11", 0, 0]]], "name": "res5a_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5a_branch2b", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5a_branch2b", 0, 0]]], "name": "bn5a_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["bn5a_branch2b", 0, 0]]], "name": "activation_12"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5a_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_12", 0, 0]]], "name": "res5a_branch2c"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5a_branch1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_10", 0, 0]]], "name": "res5a_branch1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5a_branch2c", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5a_branch2c", 0, 0]]], "name": "bn5a_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5a_branch1", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5a_branch1", 0, 0]]], "name": "bn5a_branch1"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn5a_branch2c", 0, 0], ["bn5a_branch1", 0, 0]]], "name": "merge_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "activation_13"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5b_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_13", 0, 0]]], "name": "res5b_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5b_branch2a", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5b_branch2a", 0, 0]]], "name": "bn5b_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "inbound_nodes": [[["bn5b_branch2a", 0, 0]]], "name": "activation_14"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5b_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_14", 0, 0]]], "name": "res5b_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5b_branch2b", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5b_branch2b", 0, 0]]], "name": "bn5b_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "inbound_nodes": [[["bn5b_branch2b", 0, 0]]], "name": "activation_15"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5b_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_15", 0, 0]]], "name": "res5b_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5b_branch2c", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5b_branch2c", 0, 0]]], "name": "bn5b_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn5b_branch2c", 0, 0], ["activation_13", 0, 0]]], "name": "merge_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "activation_16"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5c_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_16", 0, 0]]], "name": "res5c_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5c_branch2a", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5c_branch2a", 0, 0]]], "name": "bn5c_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "inbound_nodes": [[["bn5c_branch2a", 0, 0]]], "name": "activation_17"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5c_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_17", 0, 0]]], "name": "res5c_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5c_branch2b", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5c_branch2b", 0, 0]]], "name": "bn5c_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}, "inbound_nodes": [[["bn5c_branch2b", 0, 0]]], "name": "activation_18"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5c_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_18", 0, 0]]], "name": "res5c_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5c_branch2c", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5c_branch2c", 0, 0]]], "name": "bn5c_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_6", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn5c_branch2c", 0, 0], ["activation_16", 0, 0]]], "name": "merge_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "activation_19"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["activation_19", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "activation_20"}, {"class_name": "AveragePooling2D", "config": {"name": "avg_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3], "strides": [3, 3], "border_mode": "valid"}, "inbound_nodes": [[["activation_20", 0, 0]]], "name": "avg_pool"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["avg_pool", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "fc1000", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 20736, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 10}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "fc1000"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["fc1000", 0, 0]], "name": "resnet50"}}